docs: updating docs after changes
